IRP/src/Documents/TaxesOperation/TaxesOperation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>TaxesOperation</name>
 <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
 <registerRecords>AccumulationRegister.R1040B_TaxesOutgoing</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R2040B_TaxesIncoming</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.TaxesOperationTransactionType</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalNameContract</name>
  <type>
   <types>CatalogRef.LegalNameContracts</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>TaxesIncoming</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>InvoiceType</name>
   <type>
    <types>EnumRef.InvoiceType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>TaxesOutgoing</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>InvoiceType</name>
   <type>
    <types>EnumRef.InvoiceType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>TaxesDifference</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>IncomingVatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>IncomingInvoiceType</name>
   <type>
    <types>EnumRef.InvoiceType</types>
   </type>
  </attributes>
  <attributes>
   <name>OutgoingVatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>OutgoingInvoiceType</name>
   <type>
    <types>EnumRef.InvoiceType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R5020B_PartnersBalance/R5020B_PartnersBalance.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R5020B_PartnersBalance</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>CustomerTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>CustomerAdvance</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>VendorTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>VendorAdvance</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>OtherTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>AdvancesClosing</name>
  <type>
   <types>DocumentRef.VendorsAdvancesClosing</types>
   <types>DocumentRef.CustomersAdvancesClosing</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DefinedType.typeApArTransactionBasises</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ApArPostingDetail/ApArPostingDetail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ApArPostingDetail</name>
 <enumValues>
  <name>ByDocuments</name>
 </enumValues>
 <enumValues>
  <name>ByAgreements</name>
 </enumValues>
 <enumValues>
  <name>ByStandardAgreement</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/TaxesOperationTransactionType/TaxesOperationTransactionType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>TaxesOperationTransactionType</name>
 <enumValues>
  <name>TaxOffset</name>
 </enumValues>
 <enumValues>
  <name>TaxOffsetAndPayment</name>
 </enumValues>
 <enumValues>
  <name>TaxPayment</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/TaxesOperation/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure;
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Parameters.IsReposting = False;
	
	//AccountingServer.CreateAccountingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo);
	
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", New Array);
	Str.Insert("QueryTextsSecondaryTables", New Array);
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure;
	StrParams.Insert("Ref", Ref);
	StrParams.Insert("Vat", TaxesServer.GetVatRef());
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array();
	QueryArray.Add(TaxesDifference());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array();
	QueryArray.Add(R1040B_TaxesOutgoing());
	QueryArray.Add(R2040B_TaxesIncoming());
	QueryArray.Add(R5010B_ReconciliationStatement());
	QueryArray.Add(R5015B_OtherPartnersTransactions());
//	QueryArray.Add(T1040T_AccountingAmounts());
	QueryArray.Add(R5020B_PartnersBalance());
	Return QueryArray;
EndFunction

#EndRegion

#Region Posting_SourceTable

Function TaxesDifference()
	Return
		"SELECT
		|	TaxesDifference.Ref.Date AS Period,
		|	TaxesDifference.Ref.Company AS Company,
		|	TaxesDifference.Ref.Branch AS Branch,
		|	&Vat AS Tax,
		|	TaxesDifference.Ref.Currency AS Currency,
		|	TaxesDifference.IncomingVatRate,
		|	TaxesDifference.IncomingInvoiceType,
		|	TaxesDifference.OutgoingVatRate,
		|	TaxesDifference.OutgoingInvoiceType,
		|	TaxesDifference.Ref.Partner AS Partner,
		|	TaxesDifference.Ref.LegalName AS LegalName,
		|	TaxesDifference.Ref.LegalNameContract AS LegalNameContract,
		|	TaxesDifference.Ref.Agreement AS Agreement,
		|	CASE
		|		WHEN TaxesDifference.Ref.Agreement.ApArPostingDetail = VALUE(Enum.ApArPostingDetail.ByDocuments)
		|			THEN TaxesDifference.Ref
		|		ELSE UNDEFINED
		|	END AS Basis,
		|	TaxesDifference.Amount AS Amount,
		|	TaxesDifference.Ref.TransactionType = VALUE(Enum.TaxesOperationTransactionType.TaxOffset) AS IsTaxOffset,
		|	TaxesDifference.Ref.TransactionType = VALUE(Enum.TaxesOperationTransactionType.TaxOffsetAndPayment) AS IsTaxOffsetAndPayment,
		|	TaxesDifference.Ref.TransactionType = VALUE(Enum.TaxesOperationTransactionType.TaxPayment) AS IsTaxPayment
		|INTO TaxesDifference
		|FROM
		|	Document.TaxesOperation.TaxesDifference AS TaxesDifference
		|WHERE
		|	TaxesDifference.Ref = &Ref";
EndFunction

#EndRegion

#Region Posting_MainTables

Function R1040B_TaxesOutgoing()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	TaxesDifference.Period,
		|	TaxesDifference.Company,
		|	TaxesDifference.Branch,
		|	TaxesDifference.Tax,
		|	TaxesDifference.Currency,
		|	TaxesDifference.OutgoingVatRate AS TaxRate,
		|	TaxesDifference.OutgoingInvoiceType AS InvoiceType,
		|	TaxesDifference.Amount
		|INTO R1040B_TaxesOutgoing
		|FROM
		|	TaxesDifference as TaxesDifference
		|WHERE
		|	NOT TaxesDifference.OutgoingVatRate.Ref IS NULL ";
EndFunction 

Function R2040B_TaxesIncoming()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	TaxesDifference.Period,
		|	TaxesDifference.Company,
		|	TaxesDifference.Branch,
		|	TaxesDifference.Tax,
		|	TaxesDifference.Currency,
		|	TaxesDifference.IncomingVatRate AS TaxRate,
		|	TaxesDifference.IncomingInvoiceType AS InvoiceType,
		|	TaxesDifference.Amount
		|INTO R2040B_TaxesIncoming
		|FROM
		|	TaxesDifference as TaxesDifference
		|WHERE
		|	NOT TaxesDifference.IncomingVatRate.Ref IS NULL";
EndFunction 

Function R5015B_OtherPartnersTransactions()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	TaxesDifference.Period,
		|	TaxesDifference.Company,
		|	TaxesDifference.Branch,
		|	TaxesDifference.Currency,
		|	TaxesDifference.LegalName,
		|	TaxesDifference.Partner,
		|	TaxesDifference.Agreement,
		|	TaxesDifference.Basis,
		|	TaxesDifference.Amount AS Amount
		|INTO R5015B_OtherPartnersTransactions
		|FROM
		|	TaxesDifference AS TaxesDifference
		|WHERE
		|	NOT TaxesDifference.IncomingVatRate.Ref IS NULL
		|	AND TaxesDifference.OutgoingVatRate.Ref IS NULL
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	TaxesDifference.Period,
		|	TaxesDifference.Company,
		|	TaxesDifference.Branch,
		|	TaxesDifference.Currency,
		|	TaxesDifference.LegalName,
		|	TaxesDifference.Partner,
		|	TaxesDifference.Agreement,
		|	TaxesDifference.Basis,
		|	TaxesDifference.Amount AS Amount
		|FROM
		|	TaxesDifference AS TaxesDifference
		|WHERE
		|	NOT TaxesDifference.OutgoingVatRate.Ref IS NULL
		|	AND TaxesDifference.IncomingVatRate.Ref IS NULL";
EndFunction

Function R5010B_ReconciliationStatement()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	TaxesDifference.Period,
		|	TaxesDifference.Company,
		|	TaxesDifference.Branch,
		|	TaxesDifference.Currency,
		|	TaxesDifference.LegalName,
		|	TaxesDifference.LegalNameContract,
		|	TaxesDifference.Amount AS Amount
		|INTO R5010B_ReconciliationStatement
		|FROM
		|	TaxesDifference AS TaxesDifference
		|WHERE
		|	NOT TaxesDifference.IncomingVatRate.Ref IS NULL
		|	AND TaxesDifference.OutgoingVatRate.Ref IS NULL
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	TaxesDifference.Period,
		|	TaxesDifference.Company,
		|	TaxesDifference.Branch,
		|	TaxesDifference.Currency,
		|	TaxesDifference.LegalName,
		|	TaxesDifference.LegalNameContract,
		|	TaxesDifference.Amount AS Amount
		|FROM
		|	TaxesDifference AS TaxesDifference
		|WHERE
		|	NOT TaxesDifference.OutgoingVatRate.Ref IS NULL
		|	AND TaxesDifference.IncomingVatRate.Ref IS NULL";
EndFunction

Function R5020B_PartnersBalance()
	Return AccumulationRegisters.R5020B_PartnersBalance.R5020B_PartnersBalance_TaxesOperation();
EndFunction

#EndRegion

#Region AccessObject


// Get access key.
// 
// Parameters:
//  Obj - DocumentRef.ExpenseAccruals
// 
// Returns:
//  Map - Map:
//  *Company - CatalogRef.Companies
//	*Branch - CatalogRef.BusinessUnits
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	//@skip-check property-return-type
	//@skip-check invocation-parameter-type-intersect
	//@skip-check unknown-method-property
	AccessKeyMap.Insert("Branch", Obj.Branch);
	Return AccessKeyMap;
EndFunction

#EndRegion

#Region Accounting

//Function T1040T_AccountingAmounts()
//	Return 
//		"SELECT
//		|	CostList.Period,
//		|	CostList.Key AS RowKey,
//		|	CostList.Currency,
//		|	CostList.Amount * CostList.Factor AS Amount,
//		|	VALUE(Catalog.AccountingOperations.ExpenseAccruals_DR_R5022T_Expenses_CR_R6070T_OtherPeriodsExpenses) AS Operation,
//		|	UNDEFINED AS AdvancesClosing
//		|INTO T1040T_AccountingAmounts
//		|FROM
//		|	CostList AS CostList
//		|WHERE
//		|	CostList.IsAccrual
//		|	OR CostList.IsVoid
//		|
//		|UNION ALL
//		|
//		|SELECT
//		|	CostList.Period,
//		|	CostList.Key AS RowKey,
//		|	CostList.Currency,
//		|	CostList.Amount * CostList.Factor AS Amount,
//		|	VALUE(Catalog.AccountingOperations.ExpenseAccruals_DR_R6070T_OtherPeriodsExpenses_CR_R5022T_Expenses) AS Operation,
//		|	UNDEFINED AS AdvancesClosing
//		|FROM
//		|	CostList AS CostList
//		|WHERE
//		|	CostList.IsReverse";
//EndFunction
//
//Function GetAccountingAnalytics(Parameters) Export
//	AO = Catalogs.AccountingOperations;
//	If Parameters.Operation = AO.ExpenseAccruals_DR_R5022T_Expenses_CR_R6070T_OtherPeriodsExpenses Then
//		
//		Return GetAnalytics_DR_R5022T_Expenses_CR_R6070T_OtherPeriodsExpenses(Parameters); // Expense - Other period expense
//		
//	ElsIf Parameters.Operation = AO.ExpenseAccruals_DR_R6070T_OtherPeriodsExpenses_CR_R5022T_Expenses Then
//		
//		Return GetAnalytics_DR_R6070T_OtherPeriodsExpenses_CR_R5022T_Expenses(Parameters); // Other period expense - Expense (reverse) 
//		
//	EndIf;
//	Return Undefined;
//EndFunction

#Region Accounting_Analytics

//// Expense - Other period expense
//Function GetAnalytics_DR_R5022T_Expenses_CR_R6070T_OtherPeriodsExpenses(Parameters)
//	AccountingAnalytics = AccountingServer.GetAccountingAnalyticsResult(Parameters);
//	AccountParameters   = AccountingServer.GetAccountParameters(Parameters);
//
//	// Debit
//	Debit = AccountingServer.GetT9014S_AccountsExpenseRevenue(AccountParameters, 
//	                                                          Parameters.RowData.ExpenseType,
//	                                                          Parameters.RowData.ProfitLossCenter);
//	
//	AccountingAnalytics.Debit = Debit.AccountExpense;
//	AccountingServer.SetDebitExtDimensions(Parameters, AccountingAnalytics);
//	
//	// Credit
//	Credit = AccountingServer.GetT9014S_AccountsExpenseRevenue(AccountParameters, 
//	                                                    	   Parameters.RowData.ExpenseType,
//	                                                    	   Parameters.RowData.ProfitLossCenter);
//	                                                    
//	AccountingAnalytics.Credit = Credit.AccountOtherPeriodsExpense;
//	AccountingServer.SetCreditExtDimensions(Parameters, AccountingAnalytics);
//
//	Return AccountingAnalytics;
//EndFunction
//
//// Other period expense - Expense (reverse)
//Function GetAnalytics_DR_R6070T_OtherPeriodsExpenses_CR_R5022T_Expenses(Parameters)
//	AccountingAnalytics = AccountingServer.GetAccountingAnalyticsResult(Parameters);
//	AccountParameters   = AccountingServer.GetAccountParameters(Parameters);
//
//	// Debit
//	Debit = AccountingServer.GetT9014S_AccountsExpenseRevenue(AccountParameters, 
//	                                                          Parameters.RowData.ExpenseType,
//	                                                          Parameters.RowData.ProfitLossCenter);
//	
//	AccountingAnalytics.Debit = Debit.AccountOtherPeriodsExpense;
//	AccountingServer.SetDebitExtDimensions(Parameters, AccountingAnalytics);
//	
//	// Credit
//	Credit = AccountingServer.GetT9014S_AccountsExpenseRevenue(AccountParameters, 
//	                                                    	   Parameters.RowData.ExpenseType,
//	                                                    	   Parameters.RowData.ProfitLossCenter);
//	                                                    
//	AccountingAnalytics.Credit = Credit.AccountExpense;
//	AccountingServer.SetCreditExtDimensions(Parameters, AccountingAnalytics);
//
//	Return AccountingAnalytics;
//EndFunction
//
//Function GetHintDebitExtDimension(Parameters, ExtDimensionType, Value) Export
//	Return Value;
//EndFunction
//
//Function GetHintCreditExtDimension(Parameters, ExtDimensionType, Value) Export
//	Return Value;
//EndFunction

#EndRegion

#EndRegion
